# -*- coding: utf-8 -*-


#Данные для заполнения таблиц в БД.

employes = [
    [None, "Грегорий", "Ульянов", "2000.03.10", "male", "2022.01.12", "Веб-программист", "Веб-разработка", 34000],
    [None, "Дмитрий", "Шеспир", "1999.12.01", "male", "2020.10.19", "Веб-программист", "IT", 23000],
    [None, "Александр", "Веремеев", "1993.01.31", "male", "2019.09.17", "Веб-программист", "IT", 17000],
    [None, "Геннадий", "Осипов", "1999.04.04", "male", "2020.10.10", "Веб-программист", "Веб-разработка", 120000],
    [None, "Ульяна", "Осипова", "2002.03.10", "female", "2022.01.12", "Веб-программист", "Веб-разработка", 39000],
    [None, "Анастасия", "Рыбакова", "1999.11.11", "female", "2021.01.23", "Веб-программист", "Веб-разработка", 42000],
    [None, "Екатерина", "Скороходова", "1997.01.30", "female", "2022.09.17", "Веб-программист", "Веб-разработка", 66000],
    [None, "Яна", "Малокодящая", "2002.04.04", "female", "2021.10.10", "Веб-программист", "Веб-разработка", 11000],
    [42, "Дмитрий", "Спицев", "1999.10.11", "male", "2021.09.13", "Бэкенд разработчик", "Back-end", 39000],
    [47, "Анастасия", "Зайцева", "1992.01.08", "female", "2016.04.11", "Бекенд разработчик", "Back-end", 67000],
    [23, "Нурлан", "Сайбулайев", "1997.07.24", "male", "2022.09.12", "Бекенд разработчик", "Back-end", 170000],
    [None, "Иван", "Зубов", "2000.12.19", "male", "2021.01.01", "Бекенд разработчик", "Back-end", 189000],
    [None, "Петр", "Пуров", "2001.09.12", "male", "2022.12.12", "Бекенд разработчик", "Back-end", 101000],
    [None, "Иван", "Горнолыж", "1987.06.15", "male", "2014.10.10", "Бекенд разработчик", "Back-end", 210000],
    [None, "Петр", "Петров", "1999.10.12", "male", "2010.12.13", "Бухгалтер", "Бухгалтерия", 49000],
    [None, "Катрин", "Прежевальская", "2000.10.23", "female", "2022.08.12", "Бухгалтер", "Бухгалтерия", 32000],
    [None, "Иван", "Скрыльников", "1979.03.30", "male", "2013.10.12", "Бухгалтер", "Бухгалтерия", 56000],
    [None, "Юра", "Кипельников", "1966.10.03", "male", "2000.09.10", "Менеджер", "Отдел продаж", 76000],
    [None, "Григорий", "Трубадуров", "1963.04.14", "male", "1999.08.13", "Менеджер", "Отдел продаж", 66000],
    [None, "Людмила", "Порываева", "1968.11.01", "female", "1999.10.10", "Менеджер", "Отдел продаж", 67000]
]

list_hospital = [
    [None, 8, "2023-03-30", "2023-03-31", "Болит голова", "Обычная усталость", 1],
    [None, 23, "2023-03-22", "2023-03-26", "Давление", "Гипертония", 1],
    [None, 12, "2023-03-11", "2023-03-14", "Температура", "Грипп", 0],
    [None, 42, "2023-03-01", "2023-03-30", "Температура", "Covid-19", 1],
    [None, 23, "2023-03-04", "2023-03-06", "Боли в глазах", "Сухость глаз", 0],
    [None, 8, "2023-03-01", "2023-03-02", "Давление", "ВСД", 0],
    [None, 19, "2023-03-02", "2023-03-04", "Температура", "Грипп", 1],
    [None, 4, "2022-12-31", "2023-03-02", "Операция", "Операция на глаза, Глаукома", 1],
    [None, 47, "2020-12-30", "2023-03-12", "Дикрет", "Роды. Дикрет", 1],
    [None, 2, "2023-03-16", "2023-03-17", "Боли в животе", "Отравление", 0],
    [None, 4, "2023-03-16", "2023-03-18", "Боли в животе", "Отравление", 0]
]